Revit 2026 API

# StructuralAssetConcreteBendingReinforcement Property

---

The bending reinforcement of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ConcreteBendingReinforcement { get; set; }
```
```vb
Public Property ConcreteBendingReinforcement As Double
	Get
	Set
```
```cpp
public:
property double ConcreteBendingReinforcement {
	double get ();
	void set (double value);
}
```
```fsharp
member ConcreteBendingReinforcement : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be concrete to set this property. |

Applies to concrete-based structural assets.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace